PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
/*!
    \file    gd32f3x0_hal_usrt.c
    \brief   USRT driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

#define USRT_DUMMY_DATA            ((uint16_t) 0xFFFFU)

static uint16_t _usrt_data_bit_mask_get(hal_usrt_dev_struct *usrt);
static FlagStatus _usrt_error_flag_get(hal_usrt_dev_struct *usrt);
static void _usrt_transmit_complete_interrupt(void *usrt);
static void _usrt_transmit_interrupt(void *usrt);
static void _usrt_receive_interrupt(void *usrt);
static void _usrt_tx_rx_interrupt(void *usrt);
static void _usrt_transmit_dma(void *dma);
static void _usrt_receive_dma(void *dma);
static void _usrt_dma_error(void *dma);

/*!
    \brief      initialize the usrt structure with the default values
                note: this function must be called after the structure is created
    \param[in]  hal_struct_type: type of usrt structure for initialization
      \arg        HAL_USRT_INIT_STRUCT: initialization structure
      \arg        HAL_USRT_DEV_STRUCT: device information structure
      \arg        HAL_USRT_USER_CALLBCAK_STRUCT: user callback structure
    \param[in]  p_struct: structure pointer
    \param[out] none
    \retval     none
*/
void hal_usrt_struct_init(hal_usrt_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct) {
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
        return;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_USRT_INIT_STRUCT:
        /* initialize usrt initialization structure with the default values */
        ((hal_usrt_init_struct *)p_struct)->baudrate             = 115200U;
        ((hal_usrt_init_struct *)p_struct)->parity               = USRT_PARITY_NONE;
        ((hal_usrt_init_struct *)p_struct)->word_length          = USRT_WORD_LENGTH_8BIT;
        ((hal_usrt_init_struct *)p_struct)->stop_bit             = USRT_STOP_BIT_1;
        ((hal_usrt_init_struct *)p_struct)->direction            = USRT_DIRECTION_RX_TX;
        ((hal_usrt_init_struct *)p_struct)->rx_fifo_en           = DISABLE;
        ((hal_usrt_init_struct *)p_struct)->clock_polarity       = USRT_CLOCK_POLARITY_LOW;
        ((hal_usrt_init_struct *)p_struct)->clock_phase          = USRT_CLOCK_PHASE_1CK;
        ((hal_usrt_init_struct *)p_struct)->clock_length_lastbit = USRT_LAST_BIT_NOT_OUTPUT;
        break;

    case HAL_USRT_DEV_STRUCT:
        /* initialize usrt device information structure with the default values */
        ((hal_usrt_dev_struct *)p_struct)->periph                            = 0U;
        ((hal_usrt_dev_struct *)p_struct)->usrt_irq.error_handle             = NULL;
        ((hal_usrt_dev_struct *)p_struct)->usrt_irq.receive_complete_handle  = NULL;
        ((hal_usrt_dev_struct *)p_struct)->usrt_irq.transmit_complete_handle = NULL;
        ((hal_usrt_dev_struct *)p_struct)->usrt_irq.transmit_ready_handle    = NULL;
        ((hal_usrt_dev_struct *)p_struct)->p_dma_rx                          = NULL;
        ((hal_usrt_dev_struct *)p_struct)->p_dma_tx                          = NULL;
        ((hal_usrt_dev_struct *)p_struct)->txbuffer.buffer                   = NULL;
        ((hal_usrt_dev_struct *)p_struct)->txbuffer.length                   = 0U;
        ((hal_usrt_dev_struct *)p_struct)->txbuffer.pos                      = 0U;
        ((hal_usrt_dev_struct *)p_struct)->rxbuffer.buffer                   = NULL;
        ((hal_usrt_dev_struct *)p_struct)->rxbuffer.length                   = 0U;
        ((hal_usrt_dev_struct *)p_struct)->rxbuffer.pos                      = 0U;
        ((hal_usrt_dev_struct *)p_struct)->data_bit_mask                     = 0U;
        ((hal_usrt_dev_struct *)p_struct)->last_error                        = HAL_USRT_ERROR_NONE;
        ((hal_usrt_dev_struct *)p_struct)->error_state                       = HAL_USRT_ERROR_NONE;
        ((hal_usrt_dev_struct *)p_struct)->tx_state                          = USRT_STATE_FREE;
        ((hal_usrt_dev_struct *)p_struct)->rx_state                          = USRT_STATE_FREE;
        ((hal_usrt_dev_struct *)p_struct)->rx_callback                       = NULL;
        ((hal_usrt_dev_struct *)p_struct)->tx_callback                       = NULL;
        ((hal_usrt_dev_struct *)p_struct)->mutex                             = HAL_MUTEX_UNLOCKED;
        ((hal_usrt_dev_struct *)p_struct)->priv                              = NULL;
        break;

    case HAL_USRT_USER_CALLBCAK_STRUCT:
        /* initialize user callback structure with the default values */
        ((hal_usrt_user_callback_struct *)p_struct)->complete_func = NULL;
        ((hal_usrt_user_callback_struct *)p_struct)->error_func = NULL;
        break;

    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize the usrt
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_usrt_deinit(hal_usrt_dev_struct *usrt)
{
    uint32_t periph;

    periph = usrt->periph;
    if((USART0 == periph) || (USART1 == periph)) {
        /* deinitialize the periph and the device information sturcture */
        hals_usrt_deinit(periph);
        hal_usrt_struct_init(HAL_USRT_DEV_STRUCT, usrt);
        usrt->periph = periph;
    } else {
        HAL_DEBUGE("parameter [usrt->periph] value is invalid");
    }
}

/*!
    \brief      initialize the usrt with specified values
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USRT is initialized
    \param[in]  p_init: the initialization data needed to initialize usrt
                  baudrate: communication baudrate
                  parity: USRT_PARITY_NONE, USRT_PARITY_EVEN, USRT_PARITY_ODD
                  word_length: USRT_WORD_LENGTH_8BIT, USRT_WORD_LENGTH_9BIT
                  stop_bit: USRT_STOP_BIT_1, USRT_STOP_BIT_2, USRT_STOP_BIT_1_5
                  direction: USRT_DIRECTION_RX_TX, USRT_DIRECTION_RX_ONLY, USRT_DIRECTION_TX_ONLY
                  rx_fifo_en：DISABLE, ENABLE
                  clock_polarity: USRT_CLOCK_POLARITY_LOW, USRT_CLOCK_POLARITY_HIGH
                  clock_phase: USRT_CLOCK_PHASE_1CK, USRT_CLOCK_PHASE_2CK
                  clock_length_lastbit: USRT_LAST_BIT_NOT_OUTPUT, USRT_LAST_BIT_OUTPUT
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_init(hal_usrt_dev_struct *usrt, uint32_t periph, hal_usrt_init_struct *p_init)
{
    uint32_t reg_temp;

