PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
    /* set user-defined receive complete interrupt callback */
    if(NULL != p_irq->receive_complete_handle) {
        usrt->usrt_irq.receive_complete_handle = p_irq->receive_complete_handle;
        hals_usrt_interrupt_enable(usrt->periph, USART_INT_RBNE);
    } else {
        usrt->usrt_irq.receive_complete_handle = NULL;
        hals_usrt_interrupt_disable(usrt->periph, USART_INT_RBNE);
    }

    /* set user-defined transmit complete interrupt callback */
    if(NULL != p_irq->transmit_complete_handle) {
        usrt->usrt_irq.transmit_complete_handle = p_irq->transmit_complete_handle;
        hals_usrt_interrupt_enable(usrt->periph, USART_INT_TC);
    } else {
        usrt->usrt_irq.transmit_complete_handle = NULL;
        hals_usrt_interrupt_disable(usrt->periph, USART_INT_TC);
    }

    /* set user-defined transmit ready interrupt callback */
    if(NULL != p_irq->transmit_ready_handle) {
        usrt->usrt_irq.transmit_ready_handle = p_irq->transmit_ready_handle;
        hals_usrt_interrupt_enable(usrt->periph, USART_INT_TBE);
    } else {
        usrt->usrt_irq.transmit_ready_handle = NULL;
        hals_usrt_interrupt_disable(usrt->periph, USART_INT_TBE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_usrt_irq_handle_all_reset(hal_usrt_dev_struct *usrt)
{
    usrt->usrt_irq.error_handle             = NULL;
    usrt->usrt_irq.receive_complete_handle  = NULL;
    usrt->usrt_irq.transmit_complete_handle = NULL;
    usrt->usrt_irq.transmit_ready_handle    = NULL;
}

/*!
    \brief      transmit amounts of data, poll transmit process and completed status
                the function is blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY, HAL_ERR_TIMEOUT details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_transmit_poll(hal_usrt_dev_struct *usrt, uint8_t *p_buffer, uint32_t length, uint32_t timeout_ms)
{
    uint8_t data_length;
    uint32_t tick_start;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state) {
        HAL_DEBUGE("usrt tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock usrt */
    HAL_LOCK(usrt);

    usrt->error_state       = HAL_USRT_ERROR_NONE;
    usrt->tx_state          = USRT_STATE_BUSY;

    /* initialize transmit parameters */
    usrt->txbuffer.buffer   = (uint8_t *)p_buffer;
    usrt->txbuffer.length   = length;
    usrt->txbuffer.pos      = 0U;

    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)) {
        if(RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)) {
            data_length = 2U;
        }
    }

    /* configure timeout */
    tick_start = hal_sys_basetick_count_get();

    while(usrt->txbuffer.pos < usrt->txbuffer.length) {
        /* wait for transmit buffer empty */
        while(RESET == hals_usrt_flag_get(usrt->periph, USART_FLAG_TBE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("usrt transmit timeout");
                    /* reset the state */
                    usrt->rx_state = USRT_STATE_FREE;
                    /* unlock usrt */
                    HAL_UNLOCK(usrt);
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* send the data to be transmitted */
        if(2U == data_length) {
            hals_usrt_data_transmit(usrt->periph, (*(uint16_t *)usrt->txbuffer.buffer & (uint16_t)0x1FFU));
            usrt->txbuffer.buffer += 2;
        } else {
            hals_usrt_data_transmit(usrt->periph, (*usrt->txbuffer.buffer & (uint8_t)0xFFU));
            usrt->txbuffer.buffer++;
        }

        /* change the transmit pointer */
        usrt->txbuffer.pos++;
    }

    /* wait for transmit complete */
    while(RESET == hals_usrt_flag_get(usrt->periph, USART_FLAG_TC)) {
        if(HAL_TIMEOUT_FOREVER != timeout_ms) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                HAL_DEBUGW("usrt transmit timeout");
                /* reset the state */
                usrt->rx_state = USRT_STATE_FREE;
                /* unlock usrt */
                HAL_UNLOCK(usrt);
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    /* change the Tx state to free */
    usrt->tx_state = USRT_STATE_FREE;

    /* unlock usrt */
    HAL_UNLOCK(usrt);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data, poll receive process and completed status
                the function is blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY, HAL_ERR_TIMEOUT details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_receive_poll(hal_usrt_dev_struct *usrt, uint8_t *p_buffer, uint32_t length, uint32_t timeout_ms)
{
    uint8_t data_length;
    uint32_t tick_start;

