PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state) {
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock usrt */
    HAL_LOCK(usrt);

    usrt->rx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USRT_ERROR_NONE;

    /* initialize receive parameters */
    usrt->rxbuffer.buffer   = (uint8_t *)p_buffer;
    usrt->rxbuffer.length   = length;
    usrt->rxbuffer.pos      = 0U;
    usrt->data_bit_mask     = _usrt_data_bit_mask_get(usrt);

    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)) {
        if(RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)) {
            data_length = 2U;
        }
    }

    /* configure timeout */
    tick_start = hal_sys_basetick_count_get();

    while(usrt->rxbuffer.pos < usrt->rxbuffer.length) {
        /* send dummy byte to generate clock for the slave to send data */
        while(RESET == hals_usrt_flag_get(usrt->periph, USART_FLAG_TC)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("usrt transmit timeout");
                    /* reset the state */
                    usrt->rx_state = USRT_STATE_FREE;
                    /* unlock usrt */
                    HAL_UNLOCK(usrt);
                    return HAL_ERR_TIMEOUT;
                }
                hals_usrt_data_transmit(usrt->periph, USRT_DUMMY_DATA);
            }
        }

        /* reconfigure the timeout */
        tick_start = hal_sys_basetick_count_get();
        /* wait for read data buffer not empty */
        while(RESET == hals_usrt_flag_get(usrt->periph, USART_FLAG_RBNE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("usrt receive timeout");
                    /* reset the state */
                    usrt->rx_state = USRT_STATE_FREE;
                    /* unlock usrt */
                    HAL_UNLOCK(usrt);
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* read data from data register */
        if(2U == data_length) {
            *usrt->rxbuffer.buffer = (uint8_t)(hals_usrt_data_receive(usrt->periph) & usrt->data_bit_mask);
            usrt->rxbuffer.buffer++;
        } else {
            *(uint16_t *)usrt->rxbuffer.buffer = (hals_usrt_data_receive(usrt->periph) & usrt->data_bit_mask);
            usrt->rxbuffer.buffer += 2;
        }
        /* change the receive pointer */
        usrt->rxbuffer.pos++;
    }

    /* change the Rx state to free */
    usrt->rx_state = USRT_STATE_FREE;

    /* unlock usrt */
    HAL_UNLOCK(usrt);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit & receive amounts of data, poll transfer process and completed status
                the function is blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_tx_buffer: pointer to Tx data buffer
    \param[in]  p_rx_buffer: pointer to Rx data buffer
    \param[in]  length: number of data to be received
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_transmit_receive_poll(hal_usrt_dev_struct *usrt, uint8_t *p_tx_buffer, uint8_t *p_rx_buffer, uint32_t length, uint32_t timeout_ms)
{
    uint8_t data_length;
    uint32_t tick_start;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_tx_buffer) || (NULL == p_rx_buffer) ||
            (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_tx_buffer] or [p_rx_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* 9-bit transfer with no parity, if tx or rx buffer address is not aligned on uint16_t, return error */
    if((RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)) && \
            (RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN))) {
        if(RESET != (((uint32_t)p_tx_buffer || (uint32_t)p_rx_buffer) & 1U)) {
            return HAL_ERR_ADDRESS;
        }
    }

    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state) {
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock usrt */
    HAL_LOCK(usrt);

    /* initialize receive parameters */
    usrt->error_state = HAL_USRT_ERROR_NONE;
    usrt->rx_state = USRT_STATE_BUSY;
    usrt->rxbuffer.buffer   = (uint8_t *)p_rx_buffer;
    usrt->rxbuffer.length   = length;
    usrt->rxbuffer.pos      = 0U;
    usrt->data_bit_mask     = _usrt_data_bit_mask_get(usrt);

    /* initialize transmit parameters */
    usrt->tx_state = USRT_STATE_BUSY;
    usrt->txbuffer.buffer = (uint8_t *)p_tx_buffer;
    usrt->txbuffer.length = length;

    /* calculate the data length */
    data_length = 1;
    if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)) {
        if(RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)) {
            data_length = 2U;
        }
    }

    /* configure timeout */
    tick_start = hal_sys_basetick_count_get();

    while(usrt->rxbuffer.pos < usrt->rxbuffer.length) {
        /* wait the TBE flag is set */
        while(RESET == hals_usrt_flag_get(usrt->periph, USART_FLAG_TBE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("usrt TBE flag set timeout");
                    /* reset the state */
                    usrt->tx_state = USRT_STATE_FREE;
                    /* unlock usrt */
                    HAL_UNLOCK(usrt);
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* send the data to be transmitted */
        if(2U == data_length) {
            hals_usrt_data_transmit(usrt->periph, (*(uint16_t *)usrt->txbuffer.buffer & usrt->data_bit_mask));
            usrt->txbuffer.buffer += 2;
        } else {
            hals_usrt_data_transmit(usrt->periph, (*usrt->txbuffer.buffer & (uint8_t)usrt->data_bit_mask));
            usrt->txbuffer.buffer++;
        }

        /* wait for transmit complete */
        while(RESET == hals_usrt_flag_get(usrt->periph, USART_FLAG_TC)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("usrt transmit timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

