PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
        /* wait the RBNE flag is set */
        while(RESET == hals_usrt_flag_get(usrt->periph, USART_FLAG_RBNE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("usrt RBNE flag set timeout");
                    /* reset the state */
                    usrt->rx_state = USRT_STATE_FREE;
                    /* unlock usrt */
                    HAL_UNLOCK(usrt);
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* read data from data register */
        if(2U == data_length) {
            *(uint16_t *)usrt->rxbuffer.buffer = (hals_usrt_data_receive(usrt->periph) & usrt->data_bit_mask);
            usrt->rxbuffer.buffer += 2;
        } else {
            *usrt->rxbuffer.buffer = (uint8_t)(hals_usrt_data_receive(usrt->periph) & usrt->data_bit_mask);
            usrt->rxbuffer.buffer++;
        }

        /* change the receive pointer */
        usrt->rxbuffer.pos++;
    }

    /* change the Tx and Rx state to free */
    usrt->tx_state = USRT_STATE_FREE;
    usrt->rx_state = USRT_STATE_FREE;

    /* unlock usrt */
    HAL_UNLOCK(usrt);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method
                the function is non-blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_transmit_interrupt(hal_usrt_dev_struct *usrt, uint8_t *p_buffer, uint32_t length, hal_usrt_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state) {
        HAL_DEBUGE("usrt tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock usrt */
    HAL_LOCK(usrt);

    usrt->tx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USRT_ERROR_NONE;

    /* initialize transmit parameters */
    usrt->txbuffer.buffer   = (uint8_t *)p_buffer;
    usrt->txbuffer.length   = length;
    usrt->txbuffer.pos      = 0U;
    usrt->tx_callback       = (void *)p_user_func;

    /* configure the transmit ready and complete callback as the function implemented */
    usrt->usrt_irq.transmit_ready_handle = _usrt_transmit_interrupt;
    usrt->usrt_irq.transmit_complete_handle = _usrt_transmit_complete_interrupt;

    /* clear USRT TC interrupt flag */
    hals_usrt_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_TC);

    /* enable the TBE interrupt */
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_TBE);

    /* unlock uart */
    HAL_UNLOCK(usrt);

    hals_uart_enable(usrt->periph);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method
                the function is non-blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_receive_interrupt(hal_usrt_dev_struct *usrt, uint8_t *p_buffer, uint32_t length, hal_usrt_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state) {
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock usrt */
    HAL_LOCK(usrt);

    usrt->rx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USRT_ERROR_NONE;

    /* initialize receive parameters */
    usrt->rxbuffer.buffer   = (uint8_t *)p_buffer;
    usrt->rxbuffer.length   = length;
    usrt->rxbuffer.pos      = 0U;
    usrt->data_bit_mask     = _usrt_data_bit_mask_get(usrt);
    usrt->rx_callback       = (void *)p_user_func;
    usrt->usrt_irq.receive_complete_handle = _usrt_receive_interrupt;

    /* enable PERR, ERR, RBNE interrupt */
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_PERR);
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_ERR);
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_RBNE);

    /* unlock usrt */
    HAL_UNLOCK(usrt);

    /* send dummy byte to generate clock for the slave to send data */
    hals_usrt_data_transmit(usrt->periph, USRT_DUMMY_DATA & _usrt_data_bit_mask_get(usrt));

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit & receive amounts of data by interrupt method
                the function is non-blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_tx_buffer: pointer to Tx data buffer
    \param[in]  p_rx_buffer: pointer to Rx data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_transmit_receive_interrupt(hal_usrt_dev_struct *usrt, uint8_t *p_tx_buffer, uint8_t *p_rx_buffer, uint32_t length, hal_usrt_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_tx_buffer) || (NULL == p_rx_buffer) ||
            (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_tx_buffer] or [p_rx_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

