PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check the parameter */
    if(NULL == usrt->p_dma_rx) {
        HAL_DEBUGE("parameter [usrt->p_dma_rx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state) {
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock usrt */
    HAL_LOCK(usrt);

    usrt->rx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USRT_ERROR_NONE;

    /* initialize receive parameters */
    usrt->rxbuffer.buffer   = (uint8_t *)p_buffer;
    usrt->rxbuffer.length   = length;
    usrt->rxbuffer.pos      = 0U;
    usrt->data_bit_mask     = _usrt_data_bit_mask_get(usrt);

    if(NULL != p_func) {
        usrt->rx_callback = (void *)p_func->complete_func;
        usrt->usrt_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    } else {
        usrt->rx_callback = NULL;
        usrt->usrt_irq.error_handle = NULL;
    }

    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _usrt_receive_dma;
    dma_irq.error_handle = _usrt_dma_error;
    if(NULL != usrt->p_dma_rx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = usrt->p_dma_rx->dma_irq.half_finish_handle;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(usrt->p_dma_rx,
            (uint32_t)&USART_RDATA(usrt->periph),
            (uint32_t)usrt->rxbuffer.buffer, length, &dma_irq)) {
        usrt->rx_state = USRT_STATE_FREE;
        usrt->error_state = HAL_USRT_ERROR_DMARX;
        /* lock uart */
        HAL_LOCK(usrt);
    }

    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error) */
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_PERR);
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_ERR);

    /* usrt transmit data by DMA to generate clock */
    dma_irq.full_finish_handle = NULL;
    dma_irq.half_finish_handle = NULL;
    dma_irq.error_handle = NULL;

    /* start transmit DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(usrt->p_dma_tx, (uint32_t)usrt->txbuffer.buffer, (uint32_t)&USART_TDATA(usrt->periph), usrt->txbuffer.length, &dma_irq)) {
        usrt->rx_state = USRT_STATE_FREE;
        usrt->error_state = HAL_USRT_ERROR_DMATX;
        /* unlock uart */
        HAL_UNLOCK(usrt);
    }

    /* DMA enable for reception and transmission */
    hals_usrt_dma_receive_config(usrt->periph, USART_RECEIVE_DMA_ENABLE);
    hals_usrt_dma_transmit_config(usrt->periph, USART_TRANSMIT_DMA_ENABLE);

    /* unlock uart */
    HAL_UNLOCK(usrt);

    hals_uart_enable(usrt->periph);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit & receive amounts of data by dma method
                the function is non-blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_tx_buffer: pointer to Tx data buffer
    \param[in]  p_rx_buffer: pointer to Rx data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_transmit_receive_dma(hal_usrt_dev_struct *usrt, uint8_t *p_tx_buffer, uint8_t *p_rx_buffer, uint16_t length, hal_usrt_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_tx_buffer) || (NULL == p_rx_buffer) ||
            (0U == length)) {
        HAL_DEBUGE("parameter [usrt] or [p_tx_buffer] or [p_rx_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check the parameter */
    if(NULL == usrt->p_dma_tx) {
        HAL_DEBUGE("parameter [usrt->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy Tx Rx or not */
    if(USRT_STATE_BUSY_TX_RX == usrt->tx_state) {
        HAL_DEBUGE("usrt tx or rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock usrt */
    HAL_LOCK(usrt);

    usrt->rx_state      = USRT_STATE_BUSY_TX_RX;
    usrt->tx_state      = USRT_STATE_BUSY_TX_RX;
    usrt->error_state   = HAL_USRT_ERROR_NONE;

    /* initialize receive parameters */
    usrt->rxbuffer.buffer   = (uint8_t *)p_rx_buffer;
    usrt->rxbuffer.length   = length;
    usrt->rxbuffer.pos      = 0U;
    usrt->data_bit_mask     = _usrt_data_bit_mask_get(usrt);

    if(NULL != p_func) {
        usrt->rx_callback = (void *)p_func->complete_func;
        usrt->usrt_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    } else {
        usrt->rx_callback = NULL;
        usrt->usrt_irq.error_handle = NULL;
    }

    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _usrt_receive_dma;
    dma_irq.error_handle = _usrt_dma_error;
    if(NULL != usrt->p_dma_rx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = usrt->p_dma_rx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(usrt->p_dma_rx,
            (uint32_t)&USART_RDATA(usrt->periph),
            (uint32_t)usrt->rxbuffer.buffer, length, &dma_irq)) {
        usrt->rx_state = USRT_STATE_FREE;
        usrt->error_state = HAL_USRT_ERROR_DMARX;
        /* lock uart */
        HAL_LOCK(usrt);
    }

