PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error) */
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_PERR);
    hals_usrt_interrupt_enable(usrt->periph, USART_INT_ERR);

    /* initialize transmit parameters */
    usrt->txbuffer.buffer   = (uint8_t *)p_tx_buffer;
    usrt->txbuffer.length   = length;
    usrt->txbuffer.pos      = 0U;

    if(NULL != p_func) {
        usrt->tx_callback = (void *)p_func->complete_func;
    } else {
        usrt->tx_callback = NULL;
    }
    usrt->usrt_irq.transmit_complete_handle = _usrt_transmit_complete_interrupt;

    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle = _usrt_transmit_dma;
    dma_irq.error_handle = _usrt_dma_error;
    if(NULL != usrt->p_dma_tx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = usrt->p_dma_tx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start transmit DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(usrt->p_dma_tx, (uint32_t)usrt->txbuffer.buffer, (uint32_t)&USART_TDATA(usrt->periph), usrt->txbuffer.length, &dma_irq)) {
        usrt->rx_state = USRT_STATE_FREE;
        usrt->error_state = HAL_USRT_ERROR_DMATX;
        /* unlock uart */
        HAL_UNLOCK(usrt);
    }

    /* clear USRT TC flag */
    hals_usrt_flag_clear(usrt->periph, USART_FLAG_TC);

    /* DMA enable for reception and transmission */
    hals_usrt_dma_receive_config(usrt->periph, USART_RECEIVE_DMA_ENABLE);
    hals_usrt_dma_transmit_config(usrt->periph, USART_TRANSMIT_DMA_ENABLE);

    /* lock uart */
    HAL_LOCK(usrt);

    hals_uart_enable(usrt->periph);

    return HAL_ERR_NONE;
}

/*!
    \brief      pause usrt DMA transfer during transmission process
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_dma_pause(hal_usrt_dev_struct *usrt)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt) {
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock usrt */
    HAL_LOCK(usrt);

    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state) {
        /* disable DMA transimt */
        hals_usrt_dma_transmit_config(usrt->periph, USART_TRANSMIT_DMA_DISABLE);
    }

    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state) {
        /* disable the PERR and ERR interrupt */
        hals_usrt_interrupt_disable(usrt->periph, USART_INT_PERR);
        hals_usrt_interrupt_disable(usrt->periph, USART_INT_ERR);

        /* disable DMA receive */
        hals_usrt_dma_receive_config(usrt->periph, USART_RECEIVE_DMA_DISABLE);
    }

    /* unlock usrt */
    HAL_UNLOCK(usrt);

    return HAL_ERR_NONE;
}

/*!
    \brief      resume usrt DMA transfer during transmission process
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_dma_resume(hal_usrt_dev_struct *usrt)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt) {
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock usrt */
    HAL_LOCK(usrt);

    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state) {
        /* enable DMA transimt */
        hals_usrt_dma_transmit_config(usrt->periph, USART_TRANSMIT_DMA_ENABLE);
    }

    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state) {
        /* enable the PERR and ERR interrupt */
        hals_usrt_interrupt_enable(usrt->periph, USART_INT_PERR);
        hals_usrt_interrupt_enable(usrt->periph, USART_INT_ERR);

        /* enable DMA receive */
        hals_usrt_dma_receive_config(usrt->periph, USART_RECEIVE_DMA_ENABLE);
    }

    /* unlock usrt */
    HAL_UNLOCK(usrt);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop usrt transmit and receive transfer
                the function is blocking
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_usrt_transfer_stop(hal_usrt_dev_struct *usrt)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt) {
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock usrt */
    HAL_LOCK(usrt);

    /* disable the TBE and TC interrupt */
    hals_usrt_interrupt_disable(usrt->periph, USART_INT_TBE);
    hals_usrt_interrupt_disable(usrt->periph, USART_INT_TC);

    /* disable the RBNE, PERR and ERR interrupt */
    hals_usrt_interrupt_disable(usrt->periph, USART_INT_RBNE);
    hals_usrt_interrupt_disable(usrt->periph, USART_INT_PERR);
    hals_usrt_interrupt_disable(usrt->periph, USART_INT_ERR);

    /* disable DMA transimt and stop DMA */
    hals_usrt_dma_transmit_config(usrt->periph, USART_TRANSMIT_DMA_DISABLE);
    hal_dma_stop(usrt->p_dma_tx);

    /* disable DMA receive and stop DMA */
    hals_usrt_dma_receive_config(usrt->periph, USART_RECEIVE_DMA_DISABLE);
    hal_dma_stop(usrt->p_dma_rx);

    /* reset the position and state */
    usrt->txbuffer.pos = 0;
    usrt->tx_state = USRT_STATE_FREE;
    usrt->rxbuffer.pos = 0;
    usrt->rx_state = USRT_STATE_FREE;

    /* clear interrupt error flags */
    hals_usrt_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_PERR);
    hals_usrt_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_FERR);
    hals_usrt_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_NERR);
    hals_usrt_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_ORERR);

    /* unlock usrt */
    HAL_UNLOCK(usrt);

