PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
    return HAL_ERR_NONE;
}

/*!
    \brief      reset USRT
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_deinit(uint32_t usrt_periph)
{
    switch(usrt_periph) {
    case USART0:
        /* reset USART0 */
        hal_rcu_periph_reset_enable(RCU_USART0RST);
        hal_rcu_periph_reset_disable(RCU_USART0RST);
        break;
    case USART1:
        /* reset USART1 */
        hal_rcu_periph_reset_enable(RCU_USART1RST);
        hal_rcu_periph_reset_disable(RCU_USART1RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure USRT baud rate value
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  baudval: baud rate value
    \param[out] none
    \retval     none
*/
void hals_usrt_baudrate_set(uint32_t usrt_periph, uint32_t baudval)
{
    uint32_t uclk = 0U, intdiv = 0U, fradiv = 0U, udiv = 0U;
    switch(usrt_periph) {
    /* get clock frequency */
    case USART0:
        /* get USART0 clock */
        uclk = hals_rcu_clock_freq_get(CK_USART);
        break;
    case USART1:
        /* get USART1 clock */
        uclk = hals_rcu_clock_freq_get(CK_APB1);
        break;
    default:
        break;
    }
    if(USART_CTL0(usrt_periph) & USART_CTL0_OVSMOD) {
        /* oversampling by 8, configure the value of USART_BAUD */
        udiv = ((2U * uclk) + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = (udiv >> 1U) & 0x00000007U;
        USART_BAUD(usrt_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    } else {
        /* oversampling by 16, configure the value of USART_BAUD */
        udiv = (uclk + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = udiv & 0x0000000fU;
        USART_BAUD(usrt_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    }
}

/*!
    \brief      configure USRT parity
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  paritycfg: USRT parity configure
                only one parameter can be selected which is shown as below:
      \arg        USART_PM_NONE: no parity
      \arg        USART_PM_ODD: odd parity
      \arg        USART_PM_EVEN: even parity
    \param[out] none
    \retval     none
*/
void hals_usrt_parity_config(uint32_t usrt_periph, uint32_t paritycfg)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 PM,PCEN bits */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_PM | USART_CTL0_PCEN);
    /* configure USRT parity mode */
    USART_CTL0(usrt_periph) |= paritycfg;
}

/*!
    \brief      configure USRT word length
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  wlen: USRT word length configure
                only one parameter can be selected which is shown as below:
      \arg        USART_WL_8BIT: 8 bits
      \arg        USART_WL_9BIT: 9 bits
    \param[out] none
    \retval     none
*/
void hals_usrt_word_length_set(uint32_t usrt_periph, uint32_t wlen)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 WL bit */
    USART_CTL0(usrt_periph) &= ~USART_CTL0_WL;
    /* configure USRT word length */
    USART_CTL0(usrt_periph) |= wlen;
}

/*!
    \brief      configure USRT stop bit length
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  stblen: USRT stop bit configure
                only one parameter can be selected which is shown as below:
      \arg        USART_STB_1BIT: 1 bit
      \arg        USART_STB_0_5BIT: 0.5bit
      \arg        USART_STB_2BIT: 2 bits
      \arg        USART_STB_1_5BIT: 1.5bit
    \param[out] none
    \retval     none
*/
void hals_usrt_stop_bit_set(uint32_t usrt_periph, uint32_t stblen)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL1 STB bits */
    USART_CTL1(usrt_periph) &= ~USART_CTL1_STB;
    USART_CTL1(usrt_periph) |= stblen;
}

/*!
    \brief      enable USRT
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_enable(uint32_t usrt_periph)
{
    USART_CTL0(usrt_periph) |= USART_CTL0_UEN;
}

/*!
    \brief      disable USRT
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_disable(uint32_t usrt_periph)
{
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
}

/*!
    \brief      configure USRT transmitter
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  txconfig: enable or disable USRT transmitter
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_ENABLE: enable USRT transmission
      \arg        USART_TRANSMIT_DISABLE: enable USRT transmission
    \param[out] none
    \retval     none
*/
void hals_usrt_transmit_config(uint32_t usrt_periph, uint32_t txconfig)
{
    USART_CTL0(usrt_periph) &= ~USART_CTL0_TEN;
    /* configure transfer mode */
    USART_CTL0(usrt_periph) |= txconfig;
}

/*!
    \brief      configure USRT receiver
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  rxconfig: enable or disable USRT receiver
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_ENABLE: enable USRT reception
      \arg        USART_RECEIVE_DISABLE: disable USRT reception
    \param[out] none
    \retval     none
*/
void hals_usrt_receive_config(uint32_t usrt_periph, uint32_t rxconfig)
{
    USART_CTL0(usrt_periph) &= ~USART_CTL0_REN;
    /* configure receiver mode */
    USART_CTL0(usrt_periph) |= rxconfig;
}

/*!
    \brief      data is transmitted/received with the LSB/MSB first
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  msbf: LSB/MSB
                only one parameter can be selected which is shown as below:
      \arg        USART_MSBF_LSB: LSB first
      \arg        USART_MSBF_MSB: MSB first
    \param[out] none
    \retval     none
*/
void hals_usrt_data_first_config(uint32_t usrt_periph, uint32_t msbf)
{
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* configure LSB or MSB first */
    USART_CTL1(usrt_periph) &= ~(USART_CTL1_MSBF);
    USART_CTL1(usrt_periph) |= msbf;
}

/*!
    \brief      configure USRT inversion
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  invertpara: refer to usart_invert_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_DINV_ENABLE: data bit level inversion
      \arg        USART_DINV_DISABLE: data bit level not inversion
      \arg        USART_TXPIN_ENABLE: TX pin level inversion
      \arg        USART_TXPIN_DISABLE: TX pin level not inversion
      \arg        USART_RXPIN_ENABLE: RX pin level inversion
      \arg        USART_RXPIN_DISABLE: RX pin level not inversion
      \arg        USART_SWAP_ENABLE: swap TX/RX pins
      \arg        USART_SWAP_DISABLE: not swap TX/RX pins
    \param[out] none
    \retval     none
*/
void hals_usrt_invert_config(uint32_t usrt_periph, usart_invert_enum invertpara)
{
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* inverted or not the specified signal */
    switch(invertpara) {
    case USART_DINV_ENABLE:
        USART_CTL1(usrt_periph) |= USART_CTL1_DINV;
        break;
    case USART_DINV_DISABLE:
        USART_CTL1(usrt_periph) &= ~(USART_CTL1_DINV);
        break;
    case USART_TXPIN_ENABLE:
        USART_CTL1(usrt_periph) |= USART_CTL1_TINV;
        break;
    case USART_TXPIN_DISABLE:
        USART_CTL1(usrt_periph) &= ~(USART_CTL1_TINV);
        break;
    case USART_RXPIN_ENABLE:
        USART_CTL1(usrt_periph) |= USART_CTL1_RINV;
        break;
    case USART_RXPIN_DISABLE:
        USART_CTL1(usrt_periph) &= ~(USART_CTL1_RINV);
        break;
    case USART_SWAP_ENABLE:
        USART_CTL1(usrt_periph) |= USART_CTL1_STRP;
        break;
    case USART_SWAP_DISABLE:
        USART_CTL1(usrt_periph) &= ~(USART_CTL1_STRP);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable the USRT overrun function
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_overrun_enable(uint32_t usrt_periph)
{
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* enable overrun function */
    USART_CTL2(usrt_periph) &= ~(USART_CTL2_OVRD);
}

/*!
    \brief      disable the USRT overrun function
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_overrun_disable(uint32_t usrt_periph)
{
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* disable overrun function */
    USART_CTL2(usrt_periph) |= USART_CTL2_OVRD;
}

/*!
    \brief      configure the USRT oversample mode
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  oversamp: oversample value
                only one parameter can be selected which is shown as below:
      \arg        USART_OVSMOD_8: oversampling by 8
      \arg        USART_OVSMOD_16: oversampling by 16
    \param[out] none
    \retval     none
*/
void hals_usrt_oversample_config(uint32_t usrt_periph, uint32_t oversamp)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* clear OVSMOD bit */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_OVSMOD);
    USART_CTL0(usrt_periph) |= oversamp;
}

/*!
    \brief      configure the sample bit method
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  osb: sample bit
                only one parameter can be selected which is shown as below:
      \arg        USART_OSB_1BIT: 1 bit
      \arg        USART_OSB_3BIT: 3 bits
    \param[out] none
    \retval     none
*/
void hals_usrt_sample_bit_config(uint32_t usrt_periph, uint32_t osb)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(usrt_periph) &= ~(USART_CTL2_OSB);
    USART_CTL2(usrt_periph) |= osb;
}


/*!
    \brief      USRT transmit data function
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  data: data of transmission
    \param[out] none
    \retval     none
*/
void hals_usrt_data_transmit(uint32_t usrt_periph, uint16_t data)
{
    USART_TDATA(usrt_periph) = (USART_TDATA_TDATA & (uint32_t)data);
}

/*!
    \brief      USRT receive data function
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     data of received
*/
uint16_t hals_usrt_data_receive(uint32_t usrt_periph)
{
    return (uint16_t)(GET_BITS(USART_RDATA(usrt_periph), 0U, 8U));
}

/*!
    \brief      enable USRT command
    \param[in]  usrt_periph: USARTx(x=0,1,2)
    \param[in]  cmdtype: command type
                only one parameter can be selected which is shown as below:
      \arg        USART_CMD_SBKCMD: send break command
      \arg        USART_CMD_MMCMD: mute mode command
      \arg        USART_CMD_RXFCMD: receive data flush command
      \arg        USART_CMD_TXFCMD: transmit data flush request
    \param[out] none
    \retval     none
*/
void hals_usrt_command_enable(uint32_t usrt_periph, uint32_t cmdtype)
{
    USART_CMD(usrt_periph) |= (cmdtype);
}

/*!
    \brief      enable USRT clock
    \param[in]  usrt_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_usrt_clock_enable(uint32_t usrt_periph)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);

