PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
    USART_CTL1(usrt_periph) |= USART_CTL1_CKEN;
}

/*!
    \brief      disable USRT clock
    \param[in]  usrt_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_usrt_clock_disable(uint32_t usrt_periph)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);

    USART_CTL1(usrt_periph) &= ~(USART_CTL1_CKEN);
}

/*!
    \brief      configure USART synchronous mode parameters
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  clen: last bit clock pulse
                only one parameter can be selected which is shown as below:
      \arg        USART_CLEN_NONE: clock pulse of the last data bit (MSB) is not output to the CK pin
      \arg        USART_CLEN_EN: clock pulse of the last data bit (MSB) is output to the CK pin
    \param[in]  cph: clock phase
                only one parameter can be selected which is shown as below:
      \arg        USART_CPH_1CK: first clock transition is the first data capture edge
      \arg        USART_CPH_2CK: second clock transition is the first data capture edge
    \param[in]  cpl: clock polarity
                only one parameter can be selected which is shown as below:
      \arg        USART_CPL_LOW: steady low value on CK pin
      \arg        USART_CPL_HIGH: steady high value on CK pin
    \param[out] none
    \retval     none
*/
void hals_usrt_synchronous_clock_config(uint32_t usrt_periph, uint32_t clen, uint32_t cph, uint32_t cpl)
{
    /* disable USART */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    /* reset USART_CTL1 CLEN,CPH,CPL bits */
    USART_CTL1(usrt_periph) &= ~(USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL);

    USART_CTL1(usrt_periph) |= (USART_CTL1_CLEN & clen);
    USART_CTL1(usrt_periph) |= (USART_CTL1_CPH & cph);
    USART_CTL1(usrt_periph) |= (USART_CTL1_CPL & cpl);
}

/*!
    \brief      configure USRT DMA reception
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  dmacmd: USRT DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_DMA_ENABLE: enable USRT DMA for reception
      \arg        USART_RECEIVE_DMA_DISABLE: disable USRT DMA for reception
    \param[out] none
    \retval     none
*/
void hals_usrt_dma_receive_config(uint32_t usrt_periph, uint8_t dmacmd)
{
    USART_CTL2(usrt_periph) &= ~USART_CTL2_DENR;
    USART_CTL2(usrt_periph) |= (USART_CTL2_DENR & dmacmd);
}

/*!
    \brief      configure USRT DMA transmission
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  dmacmd: USRT DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_DMA_ENABLE: enable USRT DMA for transmission
      \arg        USART_TRANSMIT_DMA_DISABLE: disable USRT DMA for transmission
    \param[out] none
    \retval     none
*/
void hals_usrt_dma_transmit_config(uint32_t usrt_periph, uint8_t dmacmd)
{
    USART_CTL2(usrt_periph) &= ~USART_CTL2_DENT;
    USART_CTL2(usrt_periph) |= (USART_CTL2_DENT & dmacmd);
}

/*!
    \brief      enable DMA on reception error
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_reception_error_dma_enable(uint32_t usrt_periph)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(usrt_periph) &= ~(USART_CTL2_DDRE);
}

/*!
    \brief      disable DMA on reception error
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_reception_error_dma_disable(uint32_t usrt_periph)
{
    /* disable USRT */
    USART_CTL0(usrt_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(usrt_periph) |= USART_CTL2_DDRE;
}

/*!
    \brief      enable receive FIFO
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_receive_fifo_enable(uint32_t usrt_periph)
{
    USART_RFCS(usrt_periph) |= USART_RFCS_RFEN;
}

/*!
    \brief      disable receive FIFO
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_usrt_receive_fifo_disable(uint32_t usrt_periph)
{
    USART_RFCS(usrt_periph) &= ~(USART_RFCS_RFEN);
}

/*!
    \brief      read receive FIFO counter number
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[out] none
    \retval     receive FIFO counter number
*/
uint8_t hals_usrt_receive_fifo_counter_number(uint32_t usrt_periph)
{
    return (uint8_t)(GET_BITS(USART_RFCS(usrt_periph), 12U, 14U));
}

/*!
    \brief      get USRT status
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_RBNE: read data buffer not empty
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_TBE: transmit data register empty
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_CTS: CTS level
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_BSY: busy flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_SB: send break flag
      \arg        USART_FLAG_RWU: receiver wakeup from mute mode.
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_TEA: transmit enable acknowledge flag
      \arg        USART_FLAG_REA: receive enable acknowledge flag
      \arg        USART_FLAG_EPERR: early parity error flag
      \arg        USART_FLAG_RFE: receive FIFO empty flag
      \arg        USART_FLAG_RFF: receive FIFO full flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_usrt_flag_get(uint32_t usrt_periph, usart_flag_enum flag)
{
    if(RESET != (USART_REG_VAL(usrt_periph, flag) & BIT(USART_BIT_POS(flag)))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear USRT status
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void hals_usrt_flag_clear(uint32_t usrt_periph, usart_flag_enum flag)
{
    USART_INTC(usrt_periph) |= BIT(USART_BIT_POS(flag));
}

/*!
    \brief      enable USRT interrupt
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle line detected interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_usrt_interrupt_enable(uint32_t usrt_periph,
                                usart_interrupt_enum interrupt)
{
    USART_REG_VAL(usrt_periph, interrupt) |= BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      disable USRT interrupt
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_usrt_interrupt_disable(uint32_t usrt_periph,
                                 usart_interrupt_enum interrupt)
{
    USART_REG_VAL(usrt_periph, interrupt) &= ~BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      get USRT interrupt flag status
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  int_flag: interrupt and flag type, refer to usart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TBE: transmitter buffer empty interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE: read data buffer not empty interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise error interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_usrt_interrupt_flag_get(uint32_t usrt_periph,
                                        usart_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (USART_REG_VAL(usrt_periph,
                               int_flag) & BIT(USART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (USART_REG_VAL2(usrt_periph,
                                 int_flag) & BIT(USART_BIT_POS2(int_flag)));

    if(flagstatus && intenable) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear USRT interrupt flag
    \param[in]  usrt_periph: USARTx(x=0,1)
    \param[in]  flag: USRT interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS change interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise detected interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     none
*/
void hals_usrt_interrupt_flag_clear(uint32_t usrt_periph,
                                    usart_interrupt_flag_enum int_flag)
{
    if(USART_INT_FLAG_RFF == int_flag) {
        USART_RFCS(usrt_periph) &= (uint32_t)(~USART_RFCS_RFFINT);
    } else {
        USART_INTC(usrt_periph) |= BIT(USART_BIT_POS2(int_flag));
    }
}

/*!
    \brief      get the mask of data bit
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the mask of data bit(0x7F, 0xFF, 0x1FF)
*/
static uint16_t _usrt_data_bit_mask_get(hal_usrt_dev_struct *usrt)
{
    uint16_t reval;

    if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)) {
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)) {
            reval = 0xFFU;
        } else {
            reval = 0x1FFU;
        }
    } else {
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)) {
            reval = 0x7FU;
        } else {
            reval = 0xFFU;
        }
    }

    return reval;
}

/*!
    \brief      get usrt error flag
    \param[in]  usrt: usrt device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     SET or RESET
*/
static FlagStatus _usrt_error_flag_get(hal_usrt_dev_struct *usrt)
{
    if(0U == (USART_STAT(usrt->periph) & (uint32_t)(USART_STAT_PERR |
              USART_STAT_FERR | \
              USART_STAT_ORERR | USART_STAT_NERR))) {
        return RESET;
    } else {
        return SET;
    }
}

/*!
    \brief      handle the transmit complete interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_transmit_complete_interrupt(void *usrt)
{
    hal_usrt_dev_struct *p_usrt = usrt;
    hal_usrt_user_cb p_func = (hal_usrt_user_cb)p_usrt->tx_callback;
    if(USRT_STATE_BUSY_TX_RX == p_usrt->tx_state) {
        /* in Tx Rx state, the callback function is called when receive complete event occurs */
        p_func = NULL;
    }

