PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
    /* disable the transmit complete interrupt */
    hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_TC);
    /* reset transmit_complete_handle and tx_state */
    p_usrt->usrt_irq.transmit_complete_handle = NULL;
    p_usrt->tx_state = USRT_STATE_FREE;

    if(NULL != p_func) {
        /* if there is a user transmit complete callback */
        p_func(p_usrt);
    }
}

/*!
    \brief      handle the transmit interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_transmit_interrupt(void *usrt)
{
    uint32_t temp_val;
    hal_usrt_dev_struct *p_usrt = usrt;

    temp_val = p_usrt->txbuffer.pos;
    if(temp_val < p_usrt->txbuffer.length) {
        if((RESET != (USART_CTL0(p_usrt->periph) & USART_CTL0_WL)) && \
                (RESET == (USART_CTL0(p_usrt->periph) & USART_CTL0_PCEN))) {
            /* 9-bit data, none parity */
            hals_usrt_data_transmit(p_usrt->periph,
                                    (*(uint16_t *)p_usrt->txbuffer.buffer & (uint16_t)0x1FFU));
            p_usrt->txbuffer.buffer += 2U;
        } else {
            /* 9-bit data, with parity or 8-bit data */
            hals_usrt_data_transmit(p_usrt->periph,
                                    (*p_usrt->txbuffer.buffer & (uint8_t)0xFFU));
            p_usrt->txbuffer.buffer++;
        }
        p_usrt->txbuffer.pos++;
    } else {
        /* disable the TBE interrupt, enable the TC interrupt and reset the transmit_ready_handle */
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_TBE);
        hals_usrt_interrupt_enable(p_usrt->periph, USART_INT_TC);
        p_usrt->usrt_irq.transmit_ready_handle = NULL;
    }
}

/*!
    \brief      handle the receive interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_receive_interrupt(void *usrt)
{
    hal_usrt_dev_struct *p_usrt = usrt;
    hal_usrt_user_cb p_func = (hal_usrt_user_cb)p_usrt->rx_callback;

    if(0x1FFU == p_usrt->data_bit_mask) {
        /* store the received data */
        *(uint16_t *)p_usrt->rxbuffer.buffer = (hals_usrt_data_receive(p_usrt->periph) &
                                                p_usrt->data_bit_mask);
        p_usrt->rxbuffer.buffer += 2U;
    } else {
        /* store the received data */
        *p_usrt->rxbuffer.buffer = (uint8_t)(hals_usrt_data_receive(p_usrt->periph) &
                                             p_usrt->data_bit_mask);
        p_usrt->rxbuffer.buffer++;
    }
    p_usrt->rxbuffer.pos++;

    if(p_usrt->rxbuffer.pos == p_usrt->rxbuffer.length) {
        /* disable PERR, ERR, RBNE interrupt */
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_PERR);
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_ERR);
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_RBNE);

        /* reset receive_complete_handle and rx_state */
        p_usrt->usrt_irq.receive_complete_handle = NULL;
        p_usrt->rx_state = USRT_STATE_FREE;

        if(NULL != p_func) {
            /* if there is a user receive complete callback */
            p_func(p_usrt);
        }
    }
}

/*!
    \brief      handle the transmit and receive interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_tx_rx_interrupt(void *usrt)
{
    uint16_t recv_data;
    hal_usrt_dev_struct *p_usrt = usrt;

    if(USRT_STATE_BUSY_TX_RX == p_usrt->tx_state) {
        /* check whether the TBE is set or not */
        if(RESET != hals_usrt_flag_get(p_usrt->periph, USART_FLAG_TBE)) {
            if(p_usrt->txbuffer.pos < p_usrt->txbuffer.length) {
                if((RESET != (USART_CTL0(p_usrt->periph) & USART_CTL0_WL)) && \
                        (RESET == (USART_CTL0(p_usrt->periph) & USART_CTL0_PCEN))) {
                    /* 9-bit data, none parity */
                    hals_usrt_data_transmit(p_usrt->periph,
                                            (*(uint16_t *)p_usrt->txbuffer.buffer & (uint16_t)0x1FFU));
                    p_usrt->txbuffer.buffer += 2U;
                } else {
                    /* 9-bit data, with parity or 8-bit data */
                    hals_usrt_data_transmit(p_usrt->periph,
                                            (*p_usrt->txbuffer.buffer & (uint8_t)0xFFU));
                    p_usrt->txbuffer.buffer++;
                }
                p_usrt->txbuffer.pos++;
            } else {
                /* disable the TBE interrupt */
                hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_TBE);
                hals_usrt_interrupt_enable(p_usrt->periph, USART_INT_TC);
                p_usrt->usrt_irq.transmit_ready_handle = NULL;
            }
        }
    }
    if(USRT_STATE_BUSY_TX_RX == p_usrt->rx_state) {
        /* check whether the RBNE is set or not */
        if(RESET != hals_usrt_flag_get(p_usrt->periph, USART_FLAG_RBNE)) {
            recv_data = (hals_usrt_data_receive(p_usrt->periph) & p_usrt->data_bit_mask);
            if(0x1FFU == p_usrt->data_bit_mask) {
                /* 9-bit data, none parity */
                *(uint16_t *)p_usrt->rxbuffer.buffer = recv_data;
                p_usrt->rxbuffer.buffer += 2U;
            } else {
                /* 9-bit data, with parity or 8-bit data */
                *p_usrt->rxbuffer.buffer = (uint8_t)recv_data;
                p_usrt->rxbuffer.buffer++;
            }
            p_usrt->rxbuffer.pos++;
        }

        if(p_usrt->rxbuffer.pos == p_usrt->rxbuffer.length) {
            hal_usrt_user_cb p_func = (hal_usrt_user_cb)p_usrt->rx_callback;
            /* disable PERR, ERR, RBNE interrupt */
            hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_PERR);
            hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_ERR);
            hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_RBNE);
            /* reset receive_complete_handle and rx_state */
            p_usrt->usrt_irq.receive_complete_handle = NULL;
            p_usrt->rx_state = USRT_STATE_FREE;

            if(NULL != p_func) {
                /* if there is a user Tx Rx complete callback */
                p_func(p_usrt);
            }
        }
    }
}

/*!
    \brief      handle the usrt DMA transmit process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_usrt_dev_struct *p_usrt;

    p_dma = (hal_dma_dev_struct *)dma;
    p_usrt = (hal_usrt_dev_struct *)p_dma->p_periph;

