PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_usrt.c
    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        p_usrt->txbuffer.pos = p_usrt->txbuffer.length;
        hals_usrt_dma_transmit_config(p_usrt->periph, USART_TRANSMIT_DMA_DISABLE);
        /* enable TC interrupt */
        hals_usrt_interrupt_enable(p_usrt->periph, USART_INT_TC);
    }
}

/*!
    \brief      handle the usrt DMA receive process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_receive_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_usrt_dev_struct *p_usrt;
    hal_usrt_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_usrt = (hal_usrt_dev_struct *)p_dma->p_periph;
    p_func = (hal_usrt_user_cb)p_usrt->rx_callback;

    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        p_usrt->rxbuffer.pos = p_usrt->rxbuffer.length;
        /* disable DMA receive, PERR and ERR interrupt */
        hals_usrt_dma_receive_config(p_usrt->periph, USART_RECEIVE_DMA_DISABLE);
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_PERR);
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_ERR);
        /* reset rx_state */
        p_usrt->rx_state = USRT_STATE_FREE;
    }

    if(NULL != p_func) {
        /* if there is a user receive complete callback */
        p_func(p_usrt);
    }
}

/*!
    \brief      handle the UART DMA error process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_usrt_dev_struct *p_usrt;

    p_dma = (hal_dma_dev_struct *)dma;
    p_usrt = (hal_usrt_dev_struct *)p_dma->p_periph;

    if(USRT_STATE_BUSY == p_usrt->tx_state) {
        /* transmit state is busy */
        p_usrt->error_state |= HAL_USRT_ERROR_DMATX;
        p_usrt->last_error = HAL_USRT_ERROR_DMATX;
        p_usrt->txbuffer.pos = p_usrt->txbuffer.length;

        /* disable DMA transmit and reset tx_state */
        hals_usrt_dma_transmit_config(p_usrt->periph, USART_TRANSMIT_DMA_DISABLE);
        p_usrt->tx_state = USRT_STATE_FREE;
    } else if(USRT_STATE_BUSY == p_usrt->rx_state) {
        /* receive state is busy */
        p_usrt->error_state |= HAL_USRT_ERROR_DMARX;
        p_usrt->last_error = HAL_USRT_ERROR_DMARX;
        p_usrt->rxbuffer.pos = p_usrt->rxbuffer.length;

        /* disable DMA receive, PERR, ERR interrupt */
        hals_usrt_dma_receive_config(p_usrt->periph, USART_RECEIVE_DMA_DISABLE);
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_PERR);
        hals_usrt_interrupt_disable(p_usrt->periph, USART_INT_ERR);

        /* reset rx_state */
        p_usrt->rx_state = USRT_STATE_FREE;
    } else {
        HAL_DEBUGE("usrt processor fatal error: dma error exception due to run state");
    }

    if(p_usrt->usrt_irq.error_handle != NULL) {
        /* if there is a user error callback */
        p_usrt->usrt_irq.error_handle(p_usrt);
        p_usrt->error_state = HAL_USRT_ERROR_NONE;
    }
}
